AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common/examples/iox4p_eb/src/iox4p_eb.h
// Operational Modes
#define MODE_DEFAULT 0
#define MODE_IOMx_TO_1V8_PSRAM 1
#define MODE_IOMx_I2C_TO_FRAM 2
#define MODE_IOM0_TO_IOS_LB 3
#define MODE_MSPI01_TO_FLASH_MSPI2_TO_PSRAM 4
#define MODE_MSPI2_TO_DISPLAY 5
#define MODE_MSPI2_TO_DISPLAY_MSPI01_TO_PC 6
#define MODE_PC_CONN 7

// GPIO Net Assignments
#define IOS_SCK 0
#define IOS_MISO 1
#define IOS_MOSI 2
#define IOS_CE 3
#define GPIO_EMMC_OB_EN 4
#define GPIO_PC_DISP_EMMC_OB_SEL 5
#define GPIO_MSPI2_PC_DISP_EN 6
#define GPIO_IOM0_LB_SEL 7
#define GPIO_IOM_LB_EN 8
#define GPIO_IOM0_FRAM_PSRAM_EN 9
#define GPIO_IOM0127_FRAM_PSRAM_SEL 10
#define GPIO_IOM1_FRAM_PSRAM_EN 11
#define GPIO_IOM1_PC_DISP_EN 12
#define GPIO_IOM12_PC_DISP_SEL 13
#define GPIO_IOM2_FRAM_PSRAM_EN 14
#define GPIO_IOM2_PC_DISP_EN 15
#define GPIO_IOM3_PSRAM_EN 16
#define GPIO_IOM3_PC_FRAM_EN 17
#define GPIO_IOM3456_PC_FRAM_SEL 18
#define GPIO_IOM4_PSRAM_EN 19
#define GPIO_IOM4_PC_FRAM_EN 22
#define GPIO_IOM5_PSRAM_EN 23
#define GPIO_IOM5_PC_FRAM_EN 24
#define GPIO_IOM6_PSRAM_EN 25
#define GPIO_IOM6_PC_FRAM_EN 26
#define GPIO_IOM7_FRAM_PSRAM_EN 27
#define GPIO_IOM7_PC_AP1IOS_SEL 28
#define GPIO_IOM7_PC_AP1IOS_EN 29
#define GPIO_MSPI01_FLASH_EN 30
#define GPIO_IOS_LB_PC_OB_EN 31
#define GPIO_LOWER_EMMC_OB_EN 32
#define GPIO_MSPI0_PC_OB_SEL 33
#define GPIO_MSPI0_PC_OB_EN 34
#define GPIO_MSPI1_PC_OB_SEL 35
#define GPIO_MSPI1_PC_OB_EN 36
#define GPIO_LED_BLUE_1 37
#define GPIO_LED_BLUE_2 38
#define GPIO_LED_BLUE_0 39
#define GPIO_SW2 40
#define GPIO_UART_OB_PC_EN 41
#define GPIO_UART_OB_PC_SEL 42
#define GPIO_MSPI2_FLASH_PSRAM_EN 43
#define GPIO_MSPI2_FLASH_PSRAM_SEL 44
#define GPIO_LOWER_EMMC_PC_DISP_EN 45
#define GPIO_LOWER_EMMC_PC_DISP_SEL 46
#define GPIO_MSPI16_MUX_EN 47
#define GPIO_MSPI16_MUX_SEL 48
#define GPIO_DISP_GP_EN 49
